<?php

return [
    'view_all' => 'عرض الكل',

    // resposne messages for api/form calls
    'response_messages' => [
        'error' => 'حدث خطأ ما',
        'success' => 'تم بنجاح',
        'create_success' => 'تم الإنشاء بنجاح',
        'update_success' => 'تم التحديث بنجاح',
        'deleted_successflly' => 'تم الحذف بنجاح',
        'contact_success' => 'سيتم التواصل معك قريبا',
    ],
    'delete' => 'حذف',
    'confirm_delete' => 'هل انت متأكد من حذف ',
    'Caution' => "🔊 انتباه",


    // header
    'header' => [
        'about' => 'حول',
        'advantages' => 'المزايا',
        'discounts' => 'التخفيضات',
        'faq' => 'الأسئلة الشائعة',
        'contacts' => 'اتصل بنا',
        'partner' => 'كن شريكًا',
        'arabic' => 'العربية',
        'english' => 'English ',
        'getApp' => 'احصل على التطبيق',
    ],

    'sec_cover_title' => 'صفقتك هي الفائزة',
    'sec_cover_description' => 'غرضنا هو تمكين التجار من الوصول إلى جمهور أوسع والترويج لعروضهم المتنوعة، مما يمنح العملاء فرصة البقاء على اطلاع دائم على أحدث العروض والقيام بعمليات الشراء المباشرة بأفضل قيمة ممكنة.',
    'sec_cover_btn_download_app' => 'احصل على التطبيق',

    // sec_app_works
    'sec_app_works' => [
        'title' => 'كيف يعمل تطبيق زهيد',
        'step_1' => [
            'title' => 'مراجعة العروض من صفحات المتاجر',
            'description' => 'تصفح ومراجعة العروض من صفحات المتاجر المختلفة للعثور على أفضل الصفقات المتاحة.',
        ],
        'step_2' => [
            'title' => 'اختيار المنتجات من متاجر متنوعة',
            'description' => 'اختر المنتجات والخدمات من متاجر متنوعة وأضفها إلى سلة التسوق.',
        ],
        'step_3' => [
            'title' => 'الشراء المباشر',
            'description' => 'أكمل عملية الشراء بالتوجه إلى صفحة الدفع وإتمام الدفع.',
        ],
        'step_4' => [
            'title' => 'استلام الطلب',
            'description' => 'استلم طلبك في العنوان المحدد خلال الوقت المقدر للتسليم.',
        ],
    ],


    // advantages
    'advantages' => [
        'title' => 'ما هي مزايانا؟',
        'advantage_1' => [
            'title' => 'يمكن للتاجر إدارة عروض فروع متعددة بشكل فردي.',
            'description' => 'يمكن للتاجر إدارة عروض فروع متعددة بشكل فردي.'
        ],
        'advantage_2' => [
            'title' => 'يسمح للعميل بعرض العروض من المتاجر القريبة.',
            'description' => 'يسمح للعميل بعرض العروض من المتاجر القريبة.'
        ],
        'advantage_3' => [
            'title' => 'يتيح للعميل رصد العروض بشكل دوري في المتاجر.',
            'description' => 'يتيح للعميل رصد العروض بشكل دوري في المتاجر.'
        ],
        'advantage_4' => [
            'title' => 'ضمان أفضل سعر للعميل.',
            'description' => 'ضمان أفضل سعر للعميل.'
        ],
    ],


    // sec product
    'sec_product' => [
        'title' => 'أفضل الخصومات حاليًا',
        'sec_product.view_all' => 'عرض الكل',
    ],


    // sec product
    'sec_store' => [
        'title' => 'المتاجر التي تتعاون معنا',
    ],



    'sec_get_app_download' => [
        'title' => 'حمل التطبيق المجاني الآن!',
        'description' => 'نحن واثقون من أنك ستحصل على صفقات رائعة وتجربة شخصية لا مثيل لها.',
        'store_badge_1' => 'الحصول على التطبيق من',
        'store_badge_2' => 'الحصول على التطبيق من',
    ],


    'sec_massage' => [
        'title' => "كيف يساعدك زهيد؟",
        'content' => "يعزز تواصلك مع عملائك ويبسط عملية تقديم العروض الترويجية لهم مباشرة.",
        'become_partner' => "كن شريكًا",
    ],

    'footer' => [
        'title' => "جاهزون للتواصل معك على مدار الساعة طوال الأسبوع",
        'content' => "نحن واثقون من أنك ستحب العروض الرائعة والتجربة الشخصية التي نقدمها. إذا كان لديك أي أسئلة أو تعليقات، فلا تتردد في الاتصال بنا.",
        'help_title' => "كيف يمكننا مساعدتك؟",
        'name_placeholder' => "الاسم",
        'email_placeholder' => "البريد الإلكتروني",
        'message_placeholder' => "أخبرنا المزيد عن مشكلتك أو اطرح سؤالًا...",
        'contact_button' => "اتصل بنا",
        'logo_alt' => "شعار",
        'location_icon' => "الرياض، المملكة العربية السعودية",
        'email_icon' => "info@zaheed.sa",
        'sitemap_title' => "خريطة الموقع",
        'home' => "الرئيسية",
        'about' => "معلومات عنا",
        'service' => "الخدمات",
        'privacy_policy' => "سياسة الخصوصية",
        'contacts' => "اتصل بنا",
        'copyright' => "&copy; 2023 شركة حلول التوفير لتقنية المعلومات.",
        'terms_conditions' => 'شروط و أحكام الإستخدام',
        'delete_account' => 'حذف الحساب',
    ],


    'partner_registration' => [
        'attract_new_customers' => 'جذب عملاء جدد',
        'business_size_message' => 'أعمال كبيرة أو متوسطة أو صغيرة؟ أنت في المكان المناسب!',
        'registration_title' => 'تسجيل شريك جديد',
        'basic_information' => 'المعلومات الأساسية',
        'store_name_english' => 'اسم المتجر بالإنجليزية',
        'store_name_arabic' => 'اسم المتجر بالعربية',
        'category' => 'نوع النشاط',
        'select_category' => 'اختر نوع النشاط',
        'number_of_branches' => 'عدد الفروع',
        'user_name_english' => 'اسم المستخدم (بالإنجليزية)',
        'user_name_arabic' => 'اسم المستخدم (بالعربية)',
        'email' => 'البريد الإلكتروني',
        'city' => 'المدينة',
        'select_city' => 'اختر مدينة',
        'next' => 'التالي',
        'company_information' => 'معلومات الشركة',
        'fill_official_data' => 'يجب ملء بيانات الشركة الرسمية',
        'official_company_name_english' => 'اسم الشركة/المؤسسة  بالانجليزي',
        'official_company_name_arabic' => 'اسم الشركة/المؤسسة  بالعربي',
        'commercial_register' => 'رقم السجل التجاري',
        'tax_number' => 'الرقم الضريبي',
        'phone_number' => 'رقم الهاتف',
        'enter_name' => 'أدخل الاسم',
        'enter_commercial_register' => 'أدخل رقم السجل التجاري',
        'enter_tax_number' => 'أدخل الرقم الضريبي',
        'enter_email' => 'أدخل البريد الإلكتروني',
        'enter_contact_name' => 'أدخل الاسم',
        'enter_position' => 'أدخل المنصب',
        'enter_phone_number' => 'أدخل رقم الهاتف',
        'contact_name' => 'الاسم',
        'position' => 'المنصب',
        'official_papers' => 'الأوراق الرسمية',
        'fill_official_company_data' => 'يجب ملء بيانات الشركة الرسمية',
        'cr_number_of_maroof' => 'رقم السجل التجاري لـ معروف',
        'vat_registration_number' => 'رقم التسجيل في ضريبة القيمة المضافة',
        'iban' => 'رقم الايبان',
        'enter_iban' => 'أدخل رقم الآيبان',
        'drop_files_here' => 'اسحب الملفات هنا',
        'browse_files_from_computer' => 'تصفح الملفات من جهاز الكمبيوتر الخاص بك',
        'confirm' => 'تأكيد',
        'store_name_type' => 'اسم متجرك ونوعه',
        'enter_number' => 'أدخل رقم',
        'user_name_ar' => 'اسم المستخدم بالعربية',
        'user_name_en' => 'اسم المستخدم بالانجليزية',
        'company_papers' => 'أوراق الشركة',
        'bank_name' => 'البنك',
        'select_bank' => 'اختر اسم البنك',
        'other_file_1' => 'آخر',
        'other_file_2' => 'آخر',
    ],
    'please_fill_all_inputs' => 'الرجاء تعبئة جميع الحقول',
    'email_invalid' => 'الإيميل غير صالح',

    'delete_account' => 'حذف الحساب',
    'delete_account_warning' => 'هل أنت متأكد أنك تريد حذف حسابك؟ لا يمكن التراجع عن هذا الإجراء، وسيتم حذف جميع بياناتك نهائيًا.',
    'confirm_password' => 'تأكيد كلمة المرور',
    'confirm_password_placeholder' => 'أدخل كلمة المرور للتأكيد',
    'cancel' => 'إلغاء',
    'login' => 'تسجيل الدخول',
    'email_or_phone' => 'البريد الإلكتروني أو الهاتف',
    'password' => 'كلمة المرور',
    'logout' => 'تسجيل الخروج',
    'get_app' => 'احصل على التطبيق',

];
